<a href="https://colab.research.google.com/github/adilsong3/DataScience_Junior/blob/master/Cria%C3%A7%C3%A3o_de_DataFrames_para_iniciantes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Criação de DataFrames para iniciantes

####**Primeiro você sabe o que é um DataFrame?**
* Espero que o nome não te assuste. Vamos entender o que é antes de colocar a mão no código.
* Um DataFrame nada mas é do que um conjunto de colunas e linhas como se fosse um excell da vida. Veja a semelhança entre os dois:

![alt text](https://i.imgur.com/zzJwG4h.png)

**Ambos são idênticos em aparência**. Há então já que são iguais vou usar o excell pois já aprendi isso em um curso de informatica e também sempre escutei as pessoas falando crie uma planilha X, ou Y. 
****

* Confesso que durante muito tempo **utilizei o excell e ainda utilizo** em algumas coisas, mas depois que comecei a aprender as estruturas do python de manipulação de dados utilizando a biblioteca pandas, verifiquei que o excell só serve para estruturas super simples. 

* Se você utiliza o excell agora em casa ou na sua empresa não se culpe todos nós já usamos muito e não quero que deixe de usar, apenas quero que **se permita abrir o seu conhecimento ainda mais aprendendo um pouco sobre outra forma de enxergar os dados.**
****

####**Qual é objetivo principal desse notebook?**

Objetivo principal aqui é criar uma conexão sua e minha com a biblioteca pandas fazendo criações e manipulação de dataframes (um excell com infinitas possibilidades). 

* Se nunca viu algo parecido, pode ficar tranquilo o objetivo aqui  é justamente para você aqui vou mostrar formas básicas de criação e manipulação de DataFrame.
* Nesse notebook utilizaremos dicionarios e listas de formas super simples.
* Aprender isso pode fazer com que se enconomize muito tempo de pesquisa em projetos e analises futuras.

## Trabalhando com **DataFrames** a partir de **Dicionários**

* Após estudar um pouco, vemos quão facil é criar um dataframe com dicionário simples.
* Primeiro vamos importar a biblioteca pandas que citei no começo.
* Depois vamos criar um dicionario, o mesmo é definido por chaves `{}`, dentro da chave é divido por chave e valor **ex: `dicionario_1 = {'nome'  :  'Adilson Gustavo'}`**. Um ponto importante, sempre que for escrever algo precisa ser entre aspas simples ou duplas. No caso de inserir numeros segue o **ex: `dicionario_2 = {'idade' : 23}`**.

In [0]:
# importando pacote pandas
import pandas as pd

In [0]:
# Criando um dicionario com valores reais
dicionario = {
    "Nome": ['Adilson','Viviane','Matheus','Andre','Fernando','Vinicius'],
    "Idade": [23, 25, 16, 17, 13, 10],
    "Cargo": ['Suporte', 'Autonoma','Estudante','Estudante','Estudante','Estudante'],
    "Escolaridade": ['Graduando','Técnico Adm','Médio','Médio', 'Fundamental', 'Fundamental']
}

In [0]:
# Criando o dataframa utilizando o dicionario anterior
df_dic = pd.DataFrame(dicionario)

In [76]:
# Mostrando somente a cabeça do dataframe por isso função head() como padrão já puxa os 5 primeiros.
df_dic.head()

       Nome  Idade      Cargo Escolaridade
0   Adilson     23    Suporte    Graduando
1   Viviane     25   Autonoma  Técnico Adm
2   Matheus     16  Estudante        Médio
3     Andre     17  Estudante        Médio
4  Fernando     13  Estudante  Fundamental

In [0]:
# Alterando os indice utilizando o .index
df_dic.index = [129, 50, 35, 49, 199, 201]

In [78]:
# verificando os dados após a mudança do indice
df_dic.head()

         Nome  Idade      Cargo Escolaridade
129   Adilson     23    Suporte    Graduando
50    Viviane     25   Autonoma  Técnico Adm
35    Matheus     16  Estudante        Médio
49      Andre     17  Estudante        Médio
199  Fernando     13  Estudante  Fundamental

In [79]:
# Podemos facilmente buscar qualquer indice utilizando a propriedade loc[] veja um exemplo abaixo.
df_dic.loc[50]

Nome                Viviane
Idade                    25
Cargo              Autonoma
Escolaridade    Técnico Adm
Name: 50, dtype: object

## Trabalhando com **DataFrames** a partir de **listas**

* Para saber mais sobre listas pode verificar a [documentação do python](https://docs.python.org/pt-br/3/tutorial/datastructures.html).
* Para definir listas utilizamos [ ] ex: lista_1 = [[ 'nome'  , 'Adilson' ] ,  [ 'idade'  ,   23 ]].

In [0]:
# Criando uma lista
lista = [
         ["Adilson", 23, "Graduando", "Suporte Técnico"],
         ["Viviane", 25, "Técnica em Adm", "Autônoma"],
         ["Graciele", 38, "Cozinheira", "Desempregada"],
         ["Carlos", 41, "Ensino Primário", "Porteiro"]
]

In [81]:
# Mostrando a lista atual
lista

[['Adilson', 23, 'Graduando', 'Suporte Técnico'],
 ['Viviane', 25, 'Técnica em Adm', 'Autônoma'],
 ['Graciele', 38, 'Cozinheira', 'Desempregada'],
 ['Carlos', 41, 'Ensino Primário', 'Porteiro']]

* Uma pequena diferença entre criar dataframe com lista é que o cabeçalho das colunas vem como padrão numerado, mas podemos fazer a alteração utilizando o columns dentro do DataFrame

In [0]:
# Criando um dataframe utilizando a lista criada
df_lista = pd.DataFrame(lista)

In [83]:
# Mostrando o dataframe atual
df_lista

          0   1                2                3
0   Adilson  23        Graduando  Suporte Técnico
1   Viviane  25   Técnica em Adm         Autônoma
2  Graciele  38       Cozinheira     Desempregada
3    Carlos  41  Ensino Primário         Porteiro

In [0]:
# Alterando o nome das colunas
df_lista.columns = ['Nome', 'Idade', 'Escolaridade', 'Cargo atual']

In [85]:
# Mostrando DataFrame após a alteração das colunas
df_lista

       Nome  Idade     Escolaridade      Cargo atual
0   Adilson     23        Graduando  Suporte Técnico
1   Viviane     25   Técnica em Adm         Autônoma
2  Graciele     38       Cozinheira     Desempregada
3    Carlos     41  Ensino Primário         Porteiro

* Podemos também alteração o index como quisermos. Para isso basta chamar o index e atribuir o que deseja.

In [0]:
# Alterando os indices
df_lista.index = [322, 219, 1998, 2]

In [87]:
# Após alterar os index podemos simplesmente buscar qualquer indice utilizando a propriedade loc[]
df_lista.loc[322]

Nome                    Adilson
Idade                        23
Escolaridade          Graduando
Cargo atual     Suporte Técnico
Name: 322, dtype: object

In [88]:
# com a função info, podemos verificar quantos valores não são nullos, ajuda muito na analise futura
df_lista.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 322 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          4 non-null      object
 1   Idade         4 non-null      int64
 2   Escolaridade  4 non-null      object
 3   Cargo atual   4 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

# Conclusão

Meu caro leitor, nesse breve notebook minha idéia foi quebrar essa barreira de que é necessário ser um programador top para analisar dados e também mostrar para você que desconhecia essa área que existe maneiras diferentes de criar tabelas (DataFrames) para armazenar seus dados pessoas ou até de trabalho, as diferenças entre as tabelas do excell e de um dataframe são:

* No excell, ficamos limitados e/ou em algumas analises simples o mesmo dificulta **exemplo:** Para tirar a média de uma coluna no excell é necessário, colocar `=average(selecionar a coluna toda ou as celular que deseja)`** e depois dar enter.

* No DataFrame para fazer a mesma analise basta apenas chamar onde está a coluna que quer medir e chamar a função `mean()` **exemplo:** `df_lista.Idade.mean()`. No DataFrame podemos ir alem com uma simples função `describe()` ou `info()`.

* Também ficou claro que com apenas 16 linhas de códigos bem simples, conseguimos criar dois DataFrames partindo do zero.

De maneira nenhum quero que pare de utilizar o excell, apenas quis trazer uma nova forma de buscar, criar, armazenar e até manipular seus dados. Para quem já é familiariado com o python e a biblioteca pandas isso que passei foi muito simples, o objetivo é mostrar para aqueles que ainda não conhecem.

Espero de alguma maneira ter aberto uma ponta de curiosidade e que você evolua sempre.
****
#### **Contatos**
Adilson Gustavo: [Linkedin](https://www.linkedin.com/in/adilson-gustavo-a74b98133/)

Adilson Gustavo: [Github](https://github.com/adilsong3/DataScience_Junior)

****
####**Referências**

Professor: [Carlos Melo](https://www.linkedin.com/in/carlosfab/)

Blog: https://sigmoidal.ai/data-science/

Documentação: [Python DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)